test/fixtures/InvoiceTest/test_search.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.trolley.com/v1/recipients/
    body:
      encoding: UTF-8
      string: '{"type":"individual","firstName":"Tom","lastName":"Jones","email":"test.batchf5fc8eb7-a0a2-43fb-b0b8-2b95db3f79b2@example.com","address":{"street1":"123
        Wolfstrasse","city":"Berlin","country":"DE","postalCode":"123123"}}'
    headers:
      X-Pr-Timestamp:
      - '1697087951'
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 12 Oct 2023 05:19:05 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '1289'
      Connection:
      - keep-alive
      Cache-Control:
      - no-store, no-cache
      Content-Security-Policy:
      - 'default-src ''self'';base-uri ''self'';block-all-mixed-content;font-src ''self''
        https: data:;frame-ancestors ''self'';img-src ''self'' data:;object-src ''none'';script-src
        ''self'';script-src-attr ''none'';style-src ''self'' https: ''unsafe-inline'';upgrade-insecure-requests'
      X-Dns-Prefetch-Control:
      - 'off'
      Expect-Ct:
      - max-age=0
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - no-referrer
      X-Xss-Protection:
      - '0'
      Access-Control-Allow-Origin:
      - "*"
      X-Rate-Limit-Limit:
      - '600'
      X-Rate-Limit-Remaining:
      - '595'
      X-Rate-Limit-Reset:
      - '1697087978'
      Vary:
      - Origin
      Etag:
      - W/"509-8/LFtFq9+vZ1tDwijQszbbNoPSQ"
    body:
      encoding: UTF-8
      string: '{"ok":true,"recipient":{"id":"R-Ar3mXewepjvzGaLA1fMCTQ","referenceId":"R-Ar3mXewepjvzGaLA1fMCTQ","parentRecipientId":null,"email":"test.batchf5fc8eb7-a0a2-43fb-b0b8-2b95db3f79b2@example.com","name":"Tom
        Jones","lastName":"Jones","firstName":"Tom","legalName":"","type":"individual","status":"incomplete","language":"en","complianceStatus":"pending","dob":null,"passport":"","placeOfBirth":null,"updatedAt":"2023-10-12T05:19:05.376Z","createdAt":"2023-10-12T05:19:05.376Z","tags":[],"isPortalUser":false,"taxDeliveryType":"mail","contactEmails":[],"occupation":"","address":{"street1":"123
        Wolfstrasse","street2":"","city":"Berlin","postalCode":"123123","country":"DE","region":null,"phone":"","phoneValidated":false},"compliance":{"status":"pending","checkedAt":null},"gravatarUrl":"https://www.gravatar.com/avatar/10e2813fdfe5079b32ee88e3b4dbd346?d=404","governmentId":null,"ssn":null,"governmentIds":[],"birthplace":{"country":null,"region":null,"city":null},"citizenships":[],"routeType":"sepa","routeMinimum":"0","estimatedFees":"3","accounts":[],"payoutMethod":null,"primaryCurrency":null,"riskScore":null,"riskScoreLabel":null,"merchantId":"M-C7AsydAeAqW3husDNHSAND","inactiveReasons":{"primaryAccount":"missing"},"taxWithholdingPercentage":null,"taxForm":null,"taxFormStatus":null}}'
  recorded_at: Thu, 12 Oct 2023 05:19:11 GMT
- request:
    method: post
    uri: https://api.trolley.com/v1/recipients/R-Ar3mXewepjvzGaLA1fMCTQ/accounts
    body:
      encoding: UTF-8
      string: '{"type":"bank-transfer","currency":"EUR","country":"DE","iban":"DE89
        3704 0044 0532 0130 00"}'
    headers:
      X-Pr-Timestamp:
      - '1697087951'
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 12 Oct 2023 05:19:05 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '657'
      Connection:
      - keep-alive
      Cache-Control:
      - no-store, no-cache
      Content-Security-Policy:
      - 'default-src ''self'';base-uri ''self'';block-all-mixed-content;font-src ''self''
        https: data:;frame-ancestors ''self'';img-src ''self'' data:;object-src ''none'';script-src
        ''self'';script-src-attr ''none'';style-src ''self'' https: ''unsafe-inline'';upgrade-insecure-requests'
      X-Dns-Prefetch-Control:
      - 'off'
      Expect-Ct:
      - max-age=0
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - no-referrer
      X-Xss-Protection:
      - '0'
      Access-Control-Allow-Origin:
      - "*"
      X-Rate-Limit-Limit:
      - '600'
      X-Rate-Limit-Remaining:
      - '594'
      X-Rate-Limit-Reset:
      - '1697087978'
      Vary:
      - Origin
      Etag:
      - W/"291-atpNvHZW0RnLqzpuPeP/8CzrQ2A"
    body:
      encoding: UTF-8
      string: '{"ok":true,"account":{"status":"primary","type":"bank-transfer","primary":true,"currency":"EUR","id":"A-PXM5f2HNcQhQgrAPiDTvhV","recipientId":"R-Ar3mXewepjvzGaLA1fMCTQ","recipientAccountId":"A-PXM5f2HNcQhQgrAPiDTvhV","disabledAt":null,"deliveryBusinessDaysEstimate":5,"country":"DE","iban":"********************00","accountNum":"","bankAccountType":null,"bankCodeMappingId":null,"accountHolderName":"Tom
        Jones","swiftBic":"COBADEFFXXX","branchId":"","bankId":"","bankName":"Commerzbank
        AG","bankAddress":"Unter Sachsenhausen 21-27","bankCity":"Cologne","bankRegionCode":"Nordrhein-Westfalen","bankPostalCode":"50667","routeType":"sepa","recipientFees":"2"}}'
  recorded_at: Thu, 12 Oct 2023 05:19:11 GMT
- request:
    method: post
    uri: https://api.trolley.com/v1/invoices/create
    body:
      encoding: UTF-8
      string: '{"recipientId":"R-Ar3mXewepjvzGaLA1fMCTQ","description":"Integration
        Test Invoice Create"}'
    headers:
      X-Pr-Timestamp:
      - '1697087951'
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 12 Oct 2023 05:19:06 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '582'
      Connection:
      - keep-alive
      Cache-Control:
      - no-store, no-cache
      Content-Security-Policy:
      - 'default-src ''self'';base-uri ''self'';block-all-mixed-content;font-src ''self''
        https: data:;frame-ancestors ''self'';img-src ''self'' data:;object-src ''none'';script-src
        ''self'';script-src-attr ''none'';style-src ''self'' https: ''unsafe-inline'';upgrade-insecure-requests'
      X-Dns-Prefetch-Control:
      - 'off'
      Expect-Ct:
      - max-age=0
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - no-referrer
      X-Xss-Protection:
      - '0'
      Access-Control-Allow-Origin:
      - "*"
      X-Rate-Limit-Limit:
      - '600'
      X-Rate-Limit-Remaining:
      - '593'
      X-Rate-Limit-Reset:
      - '1697087978'
      Vary:
      - Origin
      Etag:
      - W/"246-w0pltmb4BBwFqMrcznJGo4WJhz0"
    body:
      encoding: UTF-8
      string: '{"ok":true,"invoice":{"id":"I-CnysFrgHxXLrQMQs6xYiXJ","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-10-12T05:19:06.220Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:19:06.219Z","updatedAt":"2023-10-12T05:19:06.219Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-Ar3mXewepjvzGaLA1fMCTQ","syncDetails":null}}'
  recorded_at: Thu, 12 Oct 2023 05:19:12 GMT
- request:
    method: post
    uri: https://api.trolley.com/v1/invoices/search
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      X-Pr-Timestamp:
      - '1697087952'
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 12 Oct 2023 05:19:06 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '8418'
      Connection:
      - keep-alive
      Cache-Control:
      - no-store, no-cache
      Content-Security-Policy:
      - 'default-src ''self'';base-uri ''self'';block-all-mixed-content;font-src ''self''
        https: data:;frame-ancestors ''self'';img-src ''self'' data:;object-src ''none'';script-src
        ''self'';script-src-attr ''none'';style-src ''self'' https: ''unsafe-inline'';upgrade-insecure-requests'
      X-Dns-Prefetch-Control:
      - 'off'
      Expect-Ct:
      - max-age=0
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - no-referrer
      X-Xss-Protection:
      - '0'
      Access-Control-Allow-Origin:
      - "*"
      X-Rate-Limit-Limit:
      - '600'
      X-Rate-Limit-Remaining:
      - '592'
      X-Rate-Limit-Reset:
      - '1697087978'
      Vary:
      - Origin
      Etag:
      - W/"20e2-e7Stua5CgDnp1ZZl+oeHPeX+ty0"
    body:
      encoding: UTF-8
      string: '{"ok":true,"invoices":[{"id":"I-CnysFrgHxXLrQMQs6xYiXJ","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-10-12T05:19:06.220Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:19:06.219Z","updatedAt":"2023-10-12T05:19:06.219Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-Ar3mXewepjvzGaLA1fMCTQ","syncDetails":null},{"id":"I-BW2J4BPWaRzLYhSuKczqzp","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-10-12T05:18:38.988Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:18:38.987Z","updatedAt":"2023-10-12T05:18:38.987Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-ShDq7tPBqw84dY3S5SiKN6","syncDetails":null},{"id":"I-Y8V5n3StX4aDoAQYnNZuQi","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"pending","externalId":null,"invoiceDate":"2023-10-12T05:16:12.768Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:16:12.767Z","updatedAt":"2023-10-12T05:16:14.001Z","totalAmount":{"value":"2000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"tags":[],"lines":[{"id":"IL-XfXdcV5SSff6D3ctnkRXkb","status":"pending","itemUrl":null,"description":"","unitAmount":{"value":"2000.00","currency":"USD"},"quantity":"1","discountAmount":{"value":"0.00","currency":"USD"},"taxAmount":{"value":"0.00","currency":"USD"},"totalAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"externalId":null,"taxReportable":true,"tags":[],"category":"services","forceUsTaxActivity":false}],"recipientId":"R-58MpbEoZZ5Wp6DZA6A1Afc","syncDetails":null},{"id":"I-8etcpH8A2UxH7GRhGNGmYJ","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"pending","externalId":null,"invoiceDate":"2023-10-12T05:15:44.578Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:15:44.577Z","updatedAt":"2023-10-12T05:15:45.622Z","totalAmount":{"value":"2000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"tags":[],"lines":[{"id":"IL-SitwgJhZugP2mYdSp47vqs","status":"pending","itemUrl":null,"description":"","unitAmount":{"value":"2000.00","currency":"USD"},"quantity":"1","discountAmount":{"value":"0.00","currency":"USD"},"taxAmount":{"value":"0.00","currency":"USD"},"totalAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"externalId":null,"taxReportable":true,"tags":[],"category":"services","forceUsTaxActivity":false}],"recipientId":"R-ESHtR37YmnrfB29qVEkiCn","syncDetails":null},{"id":"I-3SZKXZN5S6HtRV7JCZiVRJ","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-10-12T05:14:53.787Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-10-12T05:14:53.786Z","updatedAt":"2023-10-12T05:14:53.786Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-WuQZeoANTjebHwb5zDv2mS","syncDetails":null},{"id":"I-GhjuMpPj6VMPwadAjDYKpY","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-07-07T14:47:16.543Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-07-07T14:47:16.543Z","updatedAt":"2023-07-07T14:47:17.483Z","totalAmount":{"value":"3000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"0.00","currency":"USD"},"dueAmount":{"value":"3000.00","currency":"USD"},"tags":[],"lines":[{"id":"IL-HWK2UqqpDyxfHCjJ6BAjrm","status":"open","itemUrl":null,"description":"","unitAmount":{"value":"3000.00","currency":"USD"},"quantity":"1","discountAmount":{"value":"0.00","currency":"USD"},"taxAmount":{"value":"0.00","currency":"USD"},"totalAmount":{"value":"3000.00","currency":"USD"},"dueAmount":{"value":"3000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"0.00","currency":"USD"},"externalId":null,"taxReportable":true,"tags":[],"category":"services","forceUsTaxActivity":false}],"recipientId":"R-Mqbtiri4pkee6XgyLtEjok","syncDetails":null},{"id":"I-CV3jAnYeEy5vXYLpH558rQ","invoiceNumber":"","description":"Integration
        Test Invoice Update","status":"open","externalId":null,"invoiceDate":"2023-07-07T14:47:12.640Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-07-07T14:47:12.638Z","updatedAt":"2023-07-07T14:47:14.365Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-Vtw6C3kaT37TDAfcoAiv8y","syncDetails":null},{"id":"I-Qak2zrwr3RpFDKQ1vRw4ZP","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-07-07T14:47:09.524Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-07-07T14:47:09.523Z","updatedAt":"2023-07-07T14:47:10.462Z","totalAmount":{"value":"0.00","currency":"CAD"},"paidAmount":{"value":"0.00","currency":"CAD"},"pendingAmount":{"value":"0.00","currency":"CAD"},"dueAmount":{"value":"0.00","currency":"CAD"},"tags":[],"lines":[],"recipientId":"R-T8bDFRZ77FExSZyykh5Ntv","syncDetails":null},{"id":"I-0trcKbHjGnfF9ZgUhZ2cFa","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"pending","externalId":null,"invoiceDate":"2023-04-27T05:19:25.460Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-04-27T05:19:25.460Z","updatedAt":"2023-04-27T05:19:26.416Z","totalAmount":{"value":"2000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"tags":[],"lines":[{"id":"IL-492gJCBUAXsMk4SSMJVsuk","status":"pending","itemUrl":null,"description":"","unitAmount":{"value":"2000.00","currency":"USD"},"quantity":"1","discountAmount":{"value":"0.00","currency":"USD"},"taxAmount":{"value":"0.00","currency":"USD"},"totalAmount":{"value":"2000.00","currency":"USD"},"dueAmount":{"value":"0.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"2000.00","currency":"USD"},"externalId":null,"taxReportable":true,"tags":[],"category":"services","forceUsTaxActivity":false}],"recipientId":"R-BmeaJoSH5PMxnVKgQZ8UmZ","syncDetails":null},{"id":"I-EntdoCRegJUPDiEQpRPgSB","invoiceNumber":"","description":"Integration
        Test Invoice Create","status":"open","externalId":null,"invoiceDate":"2023-04-27T05:17:04.527Z","dueDate":null,"releaseAfter":null,"createdAt":"2023-04-27T05:17:04.526Z","updatedAt":"2023-04-27T05:17:05.266Z","totalAmount":{"value":"3000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"0.00","currency":"USD"},"dueAmount":{"value":"3000.00","currency":"USD"},"tags":[],"lines":[{"id":"IL-GEi47z564qg2XTdPAKJ27U","status":"open","itemUrl":null,"description":"","unitAmount":{"value":"3000.00","currency":"USD"},"quantity":"1","discountAmount":{"value":"0.00","currency":"USD"},"taxAmount":{"value":"0.00","currency":"USD"},"totalAmount":{"value":"3000.00","currency":"USD"},"dueAmount":{"value":"3000.00","currency":"USD"},"paidAmount":{"value":"0.00","currency":"USD"},"pendingAmount":{"value":"0.00","currency":"USD"},"externalId":null,"taxReportable":true,"tags":[],"category":"services","forceUsTaxActivity":false}],"recipientId":"R-2npVASUJCBjzJJAZhPQCaw","syncDetails":null}],"meta":{"page":1,"pages":2,"records":12}}'
  recorded_at: Thu, 12 Oct 2023 05:19:12 GMT
recorded_with: VCR 6.2.0
